Άσκηση 1η
==========
Σκοπός της πρώτης σειράς ασκήσεων είναι, αφ’ ενός η εξοικείωση με το προγραμματιστικό περιβάλλον της Python, αφ’ ετέρου, η εισαγωγή στους τρόπους παράστασης και επεξεργασίας τηλεπικοινωνιακών σημάτων στη συγκεκριμένη γλώσσα προγραμματισμού.
#### Jupyter notebook
To Project Jupyter είναι ένας μη κερδοσκοπικός οργανισμός με αποστολή τη συγγραφή ανοικτού λογισμικού για διαδραστικές εφαρμογές. Ξεκίνησε από ipython, ωστόσο σήμερα προσφέρει προγράμματα σε πολλές γλώσσες προγραμματισμού. 

Το [jupyter notebook](https://jupyter.org/) είναι μια πλατφόρμα web ανοικτού λογισμικού για την ανάπτυξη διαδραστικών εφαρμογών, κυρίως για επεξεργασία (επιστημονικών) δεδομένων και μηχανικής μάθησης.




```{toctree}
:hidden:
:titlesonly:


Μέρος 1 Εξάσκηση <Exercise1_1>
Μέρος 2  Δειγματοληψία - Ψηφιοποίηση <Exercise1_2>
Μέρος 3 Εφαρμογή Α <Exercise1_3>
Μέρος 4 Εφαρμογή B <Exercise1_4>
```
